app/Controllers/EmpController.php

  public function returnBook($loanId)
  {
    $session = session();
    if (!$session->get('logged_in')) {
      return redirect()->to('/login');
    }

    $model = new EmpModel();
    $loan = $model->find($loanId);

    $bookModel = new BookModel();
    $bookModel->update($loan['id_livro'], ['disponivel' => 1]);
---
UPDATE `livros` SET `disponivel` = 1
WHERE `livros`.`id` IN ('1')