app/Models/BookModel.php

SELECT `livros`.*, `emprestimos`.`id` as `emp_id`
FROM `livros`
JOIN `emprestimos` ON `emprestimos`.`id_livro` = `livros`.`id`
JOIN `usuarios` ON `usuarios`.`id` = `emprestimos`.`id_usuario`
WHERE `usuarios`.`id` = '3'
AND `emprestimos`.`data_devolucao` IS NULL
---
  public function getMyBooks($userId)
  {
    return $this->select('livros.*, emprestimos.id as emp_id')
                ->join('emprestimos', 'emprestimos.id_livro = livros.id')
                ->join('usuarios', 'usuarios.id = emprestimos.id_usuario')
                ->where('usuarios.id', $userId)
                ->where('emprestimos.data_devolucao IS NULL')
                ->findAll();