app/Models/UserModel.php

  public function getUserByUsername($nome_de_usuario)
  {
    return $this->asArray()
      ->where(['nome_de_usuario' => $nome_de_usuario])
      ->first();
---
SELECT *
FROM `usuarios`
WHERE `nome_de_usuario` = 'dedecondines@gmail.com'
 LIMIT 1